clear all
clc

data = [1	109.12	0
2	113.37	0
3	117.73	0
4	119.56	0
5	119.82	0
6	124.63	10
7	125.21	0
8	126.93	0
9	128.25	0
10	129.41	0
11	130.53	0
12	131.98	0
13	133.14	0
14	134.52	0
15	135.73	0
16	136.71	0
17	137.88	0
18	138.63	0
19	141.11	0
20	142.33	0
21	144.09	0
22	148.83	0
23	150.23	0
24	150.79	0
25	151.88	0
26	153.07	0
27	154.18	0
28	154.97	0
29	155.26	0
30	156.82	0
31	158.31	0
32	158.92	0
33	160.13	0
34	160.31	0
35	162.09	0
36	165.45	0
37	166.62	0
38	168.23	0
39	169.98	0
40	174.22	15
41	177.19	0
42	180.57	0
43	181.99	0
44	184.02	0
45	185.43	0
46	187.21	0
47	189.77	0
48	191.63	0
49	194.88	0
50	196.91	0
51	198.11	0
52	199.23	0
53	203.27	0
54	206.55	0
55	208.76	0
56	210.69	0
57	213.32	0
58	215.08	0
59	218.43	0
60	219.37	0
61	222.11	0
62	224.83	0
63	227.27	0
64	230.88	0
65	235.14	0
66	237.43	0
67	246.08	0
68	249.35	7];    %表格数据，要替换数据直接把数据复制进来就行了

m = length(data);  %数据的长度，也就是m的值
x = data(:,2);     %数据的第二列是x的数据
R = data(:,3);     %数据的第三列是R的数据

F = @(b)[sum((R+1).*(x-b(2)).^(b(1)).*log(x-b(2)))/sum((R+1).*(x-b(2)).^(b(1))) - 1/m*sum(log(x-b(2))) - 1/b(1);
    sum((R+1).*(x-b(2)).^(b(1))).*sum(1./(x-b(2)))./(m*sum((R+1).*(x-b(2)).^(b(1)-1))) - b(1)/(b(1)-1)];   
%第二个和第三个公式表达式，b(1)是beta，b(2)是t0

b = fsolve(F,[2 x(1)-1]);    %求解beta的解，其中1为求解非线性方程迭代的初始值。

beta = b(1)          %beta数据
  
t0 = b(2)            %t0数据

theta = (1/m*sum((R+1).*(x-t0).^beta)).^(1/beta)    %带回去公式1计算theta

xi = linspace(t0,max(x)*5);    %划分x

f = beta/theta^beta*(xi-t0).^(beta-1).*exp(-(xi-t0)/theta).^beta;     %pdf的公式

%　PDF
figure

plot(xi,f)

xlabel('x'),ylabel('PDF')

str = ['\theta = ' num2str(theta) ' , \beta = ' num2str(beta) ' , t0 = ' num2str(t0)];

title(str)

% CDF
F = 1-exp(-(xi-t0)/theta).^beta;

figure

plot(xi,F)

xlabel('x'),ylabel('CDF')

str = ['\theta = ' num2str(theta) ' , \beta = ' num2str(beta) ' , t0 = ' num2str(t0)];

title(str)





